Revit 2026 API

# ViewActivatedEventArgsPreviousActiveView Property

---

The previously active view.

**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public View PreviousActiveView { get; }
```
```vb
Public ReadOnly Property PreviousActiveView As View
	Get
```
```cpp
public:
property View^ PreviousActiveView {
	View^ get ();
}
```
```fsharp
member PreviousActiveView : View with get
```

#### Property Value

View

May be  if there was no previously active view.

#### Reference

ViewActivatedEventArgs Class

Autodesk.Revit.UI.Events Namespace